# REALIZAMOS UNAS MODIFICACIONES AL EJEMPLO DE CONEXION PARA PODER MEDIR LOS RETARDOS EN DISTINTAS CONSULTAS

In [22]:
import pymysql
import time
import pandas as pd

def consulta_test(consulta):
    try:
        conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
    
        try:
            with conexion.cursor() as cursor:
                # En este caso no necesitamos limpiar ningún dato
                inicio_consulta=time.time()
                print(consulta)
                cursor.execute(consulta)
 
                # Con fetchall traemos todas las filas
                fin_consulta=time.time()
                inicio_obtener_filas=time.time()
                salida = cursor.fetchall()
            
                fin_obtener_filas=time.time()
                titulos=[]
            # Recorrer e imprimir
          
          
                print("------------")
                print("TIEMPO PARA EJECUTAR CONSULTA: "+str(fin_consulta-inicio_consulta))
                print("TIEMPO PARA DEVOLVER FILAS: "+str(fin_obtener_filas-inicio_obtener_filas))
                print("CANTIDAD DE FILAS: "+str(len(salida)))
                print("------------")
                
             
                
                return salida
        finally:
            conexion.close()
    
    except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
        print("Ocurrió un error al conectar: ", e)

In [30]:
print("CONSULTA: SELECT * FROM employees ")
consulta_test("SELECT * FROM employees  ;")

print("CONSULTA: SELECT * FROM salaries ")
consulta_test("SELECT * FROM salaries  ;")

print("CONSULTA: SELECT * FROM departments ")
consulta_test("SELECT * FROM departments  ;")

CONSULTA: SELECT * FROM employees
SELECT * FROM employees  ;
------------
TIEMPO PARA EJECUTAR CONSULTA: 8.811847686767578
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 300024
------------
CONSULTA: SELECT * FROM salaries
SELECT * FROM salaries  ;
------------
TIEMPO PARA EJECUTAR CONSULTA: 58.98039889335632
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 2844047
------------
CONSULTA: SELECT * FROM departments
SELECT * FROM departments  ;
------------
TIEMPO PARA EJECUTAR CONSULTA: 0.017551898956298828
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 10
------------

(('d010', 'Ciencia de Datos'),
 ('d009', 'Customer Service'),
 ('d005', 'Development'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d001', 'Marketing'),
 ('d004', 'Production'),
 ('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d007', 'Sales'))

Como se puede apreciar el volumen de filas es lo que lleva al incremento en el tiempo de respuesta, si bien esto depende igualmente del entorno, el equipo y la configuracion que se este utilizando, la variable tiempo esta directamente relacionada a la cantidad de filas de la consulta

# Base de datos Parcial Sql, NoSql - Python - Fecha:07/06/2021

Nombre y Apellido:

Tomando como base el diagrama entidad relación de la figura superior, responder
escribir las sentencias en sql

1er Ejercicio
Obtener los datos completos de los empleados.

In [7]:
empleados=consulta_test("SELECT * FROM employees  ;")

titulos=["N empleado","Nacimiento","Nombre","Apellido","Sexo","Inicio"]
pd.DataFrame(empleados,columns=titulos)

------------
TIEMPO PARA EJECUTAR CONSULTA: 6.249678134918213
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 300024
------------

        N empleado  Nacimiento     Nombre  Apellido Sexo      Inicio
0            10001  1953-09-02     Georgi   Facello    M  1986-06-26
1            10002  1964-06-02    Bezalel    Simmel    F  1985-11-21
2            10003  1959-12-03      Parto   Bamford    M  1986-08-28
3            10004  1954-05-01  Chirstian   Koblick    M  1986-12-01
4            10005  1955-01-21    Kyoichi  Maliniak    M  1989-09-12
...            ...         ...        ...       ...  ...         ...
300019      499995  1958-09-24     Dekang  Lichtner    F  1993-01-12
300020      499996  1953-03-07       Zito      Baaz    M  1990-09-27
300021      499997  1961-08-03    Berhard    Lenart    M  1986-04-21
300022      499998  1956-09-05   Patricia   Breugel    M  1993-10-13
300023      499999  1958-05-01     Sachin   Tsukuda    M  1997-11-30

[300024 rows x 6 columns]

2do Ejercicio

Obtener los datos completos de los departamentos

In [8]:

departamentos=consulta_test("SELECT * FROM departments  ;")

titulos=["Id","Nombre"]
pd.DataFrame(departamentos,columns=titulos)

------------
TIEMPO PARA EJECUTAR CONSULTA: 0.0007948875427246094
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 9
------------

     Id              Nombre
0  d009    Customer Service
1  d005         Development
2  d002             Finance
3  d003     Human Resources
4  d001           Marketing
5  d004          Production
6  d006  Quality Management
7  d008            Research
8  d007               Sales

3er Ejercicio
Obtener la cantidad de empleados de sexo femnino.

In [10]:
empleados=consulta_test("SELECT count(gender) as Cantidad,gender FROM employees where gender =\"F\"  ;")

titulos=["Cantidad","Sexo"]
pd.DataFrame(empleados,columns=titulos)

------------
TIEMPO PARA EJECUTAR CONSULTA: 0.07598590850830078
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 1
------------

   Cantidad Sexo
0    120051    F

4to Ejercicio
Obtener la lista de empleados que son o han sido "staff". Recordar que es una consulta multi tablas.

In [13]:
empleados=consulta_test("SELECT employees.emp_no,first_name,last_name,gender FROM employees inner join titles on employees.emp_no = titles.emp_no where titles.title like \'%Staff%\';")

titulos=["N Empl","Nombre","Apellido","Sexo"]
pd.DataFrame(empleados,columns=titulos)

------------
TIEMPO PARA EJECUTAR CONSULTA: 6.0372114181518555
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 200244
------------

        N Empl    Nombre   Apellido Sexo
0        10002   Bezalel     Simmel    F
1        10005   Kyoichi   Maliniak    M
2        10005   Kyoichi   Maliniak    M
3        10007   Tzvetan  Zielinski    F
4        10007   Tzvetan  Zielinski    F
...        ...       ...        ...  ...
200239  499991     Pohua    Sichman    F
200240  499992    Siamak   Salverda    F
200241  499992    Siamak   Salverda    F
200242  499998  Patricia    Breugel    M
200243  499998  Patricia    Breugel    M

[200244 rows x 4 columns]

5to Ejercicio
Agregar el departamento Cienca de Datos.

In [28]:
import pymysql
try:
	conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
	try:
		with conexion.cursor() as cursor:
            
			consulta = "INSERT INTO `departments`(`dept_no`, `dept_name`) VALUES (%s, %s);"
			#Podemos llamar muchas veces a .execute con datos distintos
			cursor.execute(consulta, ("d010", "Ciencia de Datos"))

		conexion.commit()
	finally:
		conexion.close()
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
	print("Ocurrió un error al conectar: ", e)

In [29]:
consulta_test("select * from `departments`;")

select * from `departments`;
------------
TIEMPO PARA EJECUTAR CONSULTA: 0.0021483898162841797
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 10
------------

(('d010', 'Ciencia de Datos'),
 ('d009', 'Customer Service'),
 ('d005', 'Development'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d001', 'Marketing'),
 ('d004', 'Production'),
 ('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d007', 'Sales'))

6to Ejercicio
Agregar el empleado "Pepe" y hacerlo jefe ("manager") del departamento Cienca de Datos.

In [43]:
id=consulta_test("SELECT max(emp_no) FROM employees WHERE 1;")
idnuevo=id[0][0]+1

import pymysql
try:
	conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
	try:
		with conexion.cursor() as cursor:
            
			consulta = "INSERT INTO `employees`(`emp_no`, `birth_date`, `first_name`, `last_name`, `gender`, `hire_date`) VALUES (%s, %s, %s, %s, %s, %s);"
			#Podemos llamar muchas veces a .execute con datos distintos
			cursor.execute(consulta, (idnuevo,"1900-01-01" ,"Pepe","APELLIDOPEPE","M","1900-01-01"))

		conexion.commit()
	finally:
		conexion.close()
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
	print("Ocurrió un error al conectar: ", e)

SELECT max(emp_no) FROM employees WHERE 1;
------------
TIEMPO PARA EJECUTAR CONSULTA: 0.0006732940673828125
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 1
------------

In [45]:
consulta_test("SELECT * FROM employees WHERE first_name=\"PEPE\";")

SELECT * FROM employees WHERE first_name="PEPE";
------------
TIEMPO PARA EJECUTAR CONSULTA: 1.0214104652404785
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 1
------------

((500000,
  datetime.date(1900, 1, 1),
  'Pepe',
  'APELLIDOPEPE',
  'M',
  datetime.date(1900, 1, 1)),)

In [46]:
import pymysql
try:
	conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
	try:
		with conexion.cursor() as cursor:
            
			consulta = "INSERT INTO `dept_manager`(`emp_no`, `dept_no`, `from_date`, `to_date`) VALUES (%s, %s, %s, %s);"
			#Podemos llamar muchas veces a .execute con datos distintos
			cursor.execute(consulta, (idnuevo,"d010" ,"1900-01-01","9999-01-01"))

		conexion.commit()
	finally:
		conexion.close()
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
	print("Ocurrió un error al conectar: ", e)

In [47]:
consulta_test("SELECT * FROM dept_manager WHERE dept_no=\"d010\";")

SELECT * FROM dept_manager WHERE dept_no="d010";
------------
TIEMPO PARA EJECUTAR CONSULTA: 0.02413654327392578
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 1
------------

((500000, 'd010', datetime.date(1900, 1, 1), datetime.date(9999, 1, 1)),)

7mo Ejercicio
Borrar el empleado "Pepe".

In [49]:
import pymysql
try:
	conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
	try:
		with conexion.cursor() as cursor:
			
			consulta = "DELETE FROM employees WHERE first_name = %s;"
			nombre = "Pepe"
			cursor.execute(consulta, (nombre))

		# No olvidemos hacer commit cuando hacemos un cambio a la BD
		conexion.commit()
	finally:
		conexion.close()
	
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
	print("Ocurrió un error al conectar: ", e)

In [51]:
consulta_test("SELECT * FROM employees WHERE first_name=\"Pepe\";")

SELECT * FROM employees WHERE first_name="Pepe";
------------
TIEMPO PARA EJECUTAR CONSULTA: 0.9311678409576416
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 0
------------

()

8vo Ejercicio
Obtener el promedio de salarios por departamento.

In [52]:
consulta= "SELECT departments.dept_name ,avg(salaries.salary) as SUELDO_PROMEDIO FROM `departments`  LEFT JOIN `dept_emp` ON `dept_emp`.`dept_no` = `departments`.`dept_no` LEFT JOIN `employees` ON `dept_emp`.`emp_no` = `employees`.`emp_no` LEFT JOIN `salaries` ON `salaries`.`emp_no` = `employees`.`emp_no` group by departments.dept_name;"
consulta_test(consulta)

SELECT departments.dept_name ,avg(salaries.salary) as SUELDO_PROMEDIO FROM `departments`  LEFT JOIN `dept_emp` ON `dept_emp`.`dept_no` = `departments`.`dept_no` LEFT JOIN `employees` ON `dept_emp`.`emp_no` = `employees`.`emp_no` LEFT JOIN `salaries` ON `salaries`.`emp_no` = `employees`.`emp_no` group by departments.dept_name;
------------
TIEMPO PARA EJECUTAR CONSULTA: 16.5998637676239
TIEMPO PARA DEVOLVER FILAS: 0.0
CANTIDAD DE FILAS: 10
------------

(('Ciencia de Datos', None),
 ('Customer Service', Decimal('58770.3665')),
 ('Development', Decimal('59478.9012')),
 ('Finance', Decimal('70489.3649')),
 ('Human Resources', Decimal('55574.8794')),
 ('Marketing', Decimal('71913.2000')),
 ('Production', Decimal('59605.4825')),
 ('Quality Management', Decimal('57251.2719')),
 ('Research', Decimal('59665.1817')),
 ('Sales', Decimal('80667.6058')))